In [1]:
%load_ext sql
%sql postgresql://postgres:RKhM7ewvU7quDC@localhost:5432/dme_m03

In [2]:
%%sql
SELECT table_name FROM information_schema.tables WHERE table_schema='public';

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('employee',),
 ('facility',),
 ('location',),
 ('customer',),
 ('eventrequest',),
 ('eventplan',),
 ('eventplanline',),
 ('resourcetbl',)]

# SELECT Statement Problems

## 1. For event requests, list the event number, event date (eventrequest.dateheld), and count of the event plans.  Only include event requests in the result if the event request has more than one related event plan with a work date in December 2018.

In [3]:
%%sql

SELECT
eventrequest.eventno,
eventrequest.dateheld,
COUNT(*) AS eventplancount

FROM eventrequest
INNER JOIN eventplan 
ON eventrequest.eventno = eventplan.eventno

WHERE eventplan.workdate 
BETWEEN '2018-12-01' AND '2018-12-31'

GROUP BY eventrequest.eventno

HAVING COUNT(*) > 1;

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[('E106', datetime.date(2018, 12, 12), 2)]

## 2. List the plan number, event number, work date, and activity of event plans meeting the following two conditions: (1) the work date is in December 2018 and (2) the event is held in the “Basketball arena”.  Your query must not use the facility number (“F101”) of the basketball arena in the WHERE clause. Instead, you should use a condition on the FacName column for the value of “Basketball arena”.

In [4]:
%%sql

SELECT 
planno,
eventplan.eventno,
workdate,
activity

FROM eventplan

INNER JOIN eventrequest
ON eventplan.eventno = eventrequest.eventno

INNER JOIN facility 
ON eventrequest.facno = facility.facno

WHERE 
(workdate  BETWEEN '2018-12-01' AND '2018-12-31')
AND 
(facility.facname = 'Basketball arena');

 * postgresql://postgres:***@localhost:5432/dme_m03
4 rows affected.

[('P101', 'E104', datetime.date(2018, 12, 3), 'Operation'),
 ('P102', 'E105', datetime.date(2018, 12, 5), 'Operation'),
 ('P103', 'E106', datetime.date(2018, 12, 12), 'Operation'),
 ('P349', 'E106', datetime.date(2018, 12, 12), 'Setup')]

## 3. List the event number, event date, status, and estimated cost of events where there is an event plan managed by Mary Manager and the event is held in the basketball arena in the period October 1 to December 31, 2018.  Your query must not use the facility number (“F101”) of the basketball arena or the employee number (“E101”) of “Mary Manager” in the WHERE clause. Thus, the WHERE clause should not have conditions involving the facility number or employee number compared to constant values.

In [5]:
%%sql

SELECT 
eventrequest.eventno, dateheld,
status, estcost

FROM 
eventrequest, facility,
eventplan, employee

WHERE 
eventrequest.facno = facility.facno
AND 
eventrequest.eventno = eventplan.eventno
AND 
eventplan.empno = employee.empno
AND 
dateheld BETWEEN '2018-10-01' AND '2018-12-31'
AND 
facname = 'Basketball arena'
AND 
empname = 'Mary Manager';

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[('E106', datetime.date(2018, 12, 12), 'Approved', 2000)]

## 4. List the plan number, line number, resource name, number of resources (eventplanline.number), location name, time start, and time end where the event is held at the basketball arena, the event plan has activity of activity of “Operation”, and the event plan has a work date in the period October 1 to December 31, 2018.  Your query must not use the facility number (“F101”) of the basketball arena in the WHERE clause. Instead, you should use a condition on the FacName column for the value of “Basketball arena”.

In [6]:
%%sql

SELECT 
eventplanline.planno, lineno, 
resname, numberfld, locname, 
timestart, timeend

FROM 
eventplanline, eventplan, 
resourcetbl, location,
facility

WHERE 
eventplanline.planno = eventplan.planno
AND 
eventplanline.resno = resourcetbl.resno
AND 
eventplanline.locno = location.locno
AND 
location.facno = facility.facno
AND 
workdate BETWEEN '2018-10-01' AND '2018-12-31'
AND 
activity = 'Operation'
AND 
facname = 'Basketball arena';

 * postgresql://postgres:***@localhost:5432/dme_m03
9 rows affected.

[('P101', 1, 'attendant', 2, 'Locker room', datetime.datetime(2018, 12, 3, 18, 0), datetime.datetime(2018, 12, 3, 20, 0)),
 ('P101', 2, 'attendant', 4, 'Gate', datetime.datetime(2018, 12, 3, 18, 30), datetime.datetime(2018, 12, 3, 19, 0)),
 ('P101', 3, 'nurse', 2, 'Locker room', datetime.datetime(2018, 12, 3, 19, 0), datetime.datetime(2018, 12, 3, 20, 0)),
 ('P102', 1, 'attendant', 2, 'Locker room', datetime.datetime(2018, 12, 5, 18, 0), datetime.datetime(2018, 12, 5, 19, 0)),
 ('P102', 2, 'attendant', 4, 'Gate', datetime.datetime(2018, 12, 5, 18, 0), datetime.datetime(2018, 12, 5, 21, 0)),
 ('P102', 3, 'nurse', 2, 'Locker room', datetime.datetime(2018, 12, 5, 19, 0), datetime.datetime(2018, 12, 5, 22, 0)),
 ('P103', 1, 'attendant', 2, 'Locker room', datetime.datetime(2018, 12, 12, 18, 0), datetime.datetime(2018, 12, 12, 21, 0)),
 ('P103', 2, 'attendant', 4, 'Gate', datetime.datetime(2018, 12, 12, 18, 0), datetime.datetime(2018, 12, 12, 21, 0)),
 ('P103', 3, 'nurse', 2, 'Locker room', datetime.datetime(2018, 12, 12, 19, 0), datetime.datetime(2018, 12, 12, 22, 0))]

# Database Modification Problems

## 1. Insert a new row into the Facility table with facility name “Swimming Pool”.

In [ ]:
%%sql

INSERT INTO facility 
(facno, facname) 

VALUES 
('F104', 'Swimming Pool');

In [ ]:
%%sql

SELECT * FROM facility;

 * postgresql://postgres:***@localhost:5432/dme_m03
5 rows affected.

[('F100', 'Football stadium'),
 ('F101', 'Basketball arena'),
 ('F102', 'Baseball field'),
 ('F103', 'Recreation room'),
 ('F104', 'Swimming Pool')]

## 2. Insert a new row in the Location table related to the Facility row in modification problem 1. The new row should have “Door” for the location name.

In [ ]:
%%sql

INSERT INTO location 
(locno, facno, locname)

VALUES 
('L107', 'F104', 'Door');

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM location;

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('L100', 'F100', 'Locker room'),
 ('L101', 'F100', 'Plaza'),
 ('L102', 'F100', 'Vehicle gate'),
 ('L103', 'F101', 'Locker room'),
 ('L104', 'F100', 'Ticket Booth'),
 ('L105', 'F101', 'Gate'),
 ('L106', 'F100', 'Pedestrian gate'),
 ('L107', 'F104', 'Door')]

## 3. Insert a new row in the Location table related to the Facility row in modification problem 1. The new row should have “Locker Room” for the location name.

In [ ]:
%%sql

INSERT INTO location 
(locno, facno, locname)

VALUES 
('L108', 'F104', 'Locker Room');

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM location;

 * postgresql://postgres:***@localhost:5432/dme_m03
9 rows affected.

[('L100', 'F100', 'Locker room'),
 ('L101', 'F100', 'Plaza'),
 ('L102', 'F100', 'Vehicle gate'),
 ('L103', 'F101', 'Locker room'),
 ('L104', 'F100', 'Ticket Booth'),
 ('L105', 'F101', 'Gate'),
 ('L106', 'F100', 'Pedestrian gate'),
 ('L107', 'F104', 'Gate'),
 ('L108', 'F104', 'Locker Room')]

## 4. Change the location name of “Door” to “Gate” for the row inserted in modification problem 2. In MySQL, you need to place the UPDATE statement between two SET statements.

In [ ]:
%%sql

UPDATE location
SET locname = 'Gate'
WHERE locno = 'L107';

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM location;

 * postgresql://postgres:***@localhost:5432/dme_m03
9 rows affected.

[('L100', 'F100', 'Locker room'),
 ('L101', 'F100', 'Plaza'),
 ('L102', 'F100', 'Vehicle gate'),
 ('L103', 'F101', 'Locker room'),
 ('L104', 'F100', 'Ticket Booth'),
 ('L105', 'F101', 'Gate'),
 ('L106', 'F100', 'Pedestrian gate'),
 ('L108', 'F104', 'Locker Room'),
 ('L107', 'F104', 'Gate')]

## 5. Delete the row inserted in modification problem 3.

In [ ]:
%%sql

DELETE FROM location
WHERE locno = 'L108';

 * postgresql://postgres:***@localhost:5432/dme_m03
1 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM location;

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('L100', 'F100', 'Locker room'),
 ('L101', 'F100', 'Plaza'),
 ('L102', 'F100', 'Vehicle gate'),
 ('L103', 'F101', 'Locker room'),
 ('L104', 'F100', 'Ticket Booth'),
 ('L105', 'F101', 'Gate'),
 ('L106', 'F100', 'Pedestrian gate'),
 ('L107', 'F104', 'Door')]